In [2]:
%matplotlib inline
import pandas as pd

In [3]:
titles = pd.read_csv('titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### How many movies are listed in the titles dataframe?

In [4]:
print("Number of movies listed in the titles dataframe :",len(titles))

Number of movies listed in the titles dataframe : 244914

### What are the earliest two films listed in the titles dataframe?

In [5]:
titles.sort_values(by="year", ascending=True).head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [6]:
len(titles[titles["title"]=="Hamlet"])

20

### How many movies are titled "North by Northwest"?

In [7]:
len(titles[titles["title"]=="North by Northwest"])

1

### When was the first movie titled "Hamlet" made?

In [8]:
titles[titles["title"]=="Hamlet"].sort_values(by="year").head(1)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [9]:
titles[titles["title"]=="Treasure Island"].sort_values(by="year")

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [10]:
len(titles[titles["year"] == 1950])

1113

### How many movies were made in the year 1960?

In [11]:
len(titles[titles["year"] == 1960])

1549

### How many movies were made from 1950 through 1959?

In [12]:
years=[1950,1959]
len(titles[titles.year.isin(years)])

2628

### In what years has a movie titled "Batman" been released?

In [13]:
titles[titles.title == "Batman"]

         title  year
39349   Batman  1943
240896  Batman  1989

### How many roles were there in the movie "Inception"?

In [16]:
cast = pd.read_csv("cast.csv")
cast.drop_duplicates(inplace=True)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [18]:
len(cast[cast.title=="Inception"])

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [21]:
cast[cast.title=="Inception"]["n"].isna().sum()

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [22]:
cast[cast.title=="Inception"]["n"].notna().sum()

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [24]:
nbn = cast[cast.title == "North by Northwest"]
nbn[nbn["n"].notna()].sort_values(by="n")
#cast[cast.title == "North by Northwest"][cast[cast.title == "North by Northwest"]["n"].notna()]

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [27]:
sleuth = cast[cast.title == "Sleuth"]
sleuth_1972 = sleuth[sleuth.year == 1972]
sleuth_1972.sort_values(by="n")

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [28]:
sleuth_2007 = sleuth[sleuth.year==2007]
sleuth_2007.sort_values(by="n")

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [29]:
hamlet = cast[cast.title == "Hamlet"]
hamlet_1921 = hamlet[hamlet.year == 1921]
hamlet_1921

          title  year                    name     type         character    n
7789     Hamlet  1921        Fritz Achterberg    actor       Fortinbras,  9.0
458904   Hamlet  1921            Paul Conradi    actor      K?nig Hamlet  2.0
555034   Hamlet  1921        Anton De Verdier    actor           Laertes  7.0
1135279  Hamlet  1921         Hans Junkermann    actor          Polonius  6.0
2185558  Hamlet  1921            Heinz Stieda    actor           Horatio  5.0
2375993  Hamlet  1921  Eduard von Winterstein    actor          Claudius  4.0
2664423  Hamlet  1921         Mathilde Brandt  actress  K?nigin Gertrude  3.0
3062023  Hamlet  1921          Lilly Jacobson  actress           Ophelia  8.0
3355176  Hamlet  1921            Asta Nielsen  actress            Hamlet  1.0

In [31]:
len(hamlet_1921)

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [34]:
hamlet_1996 = hamlet[hamlet["year"]==1996]
hamlet_1996[hamlet_1996.name.str.endswith("Branagh")]

         title  year             name   type character    n
260225  Hamlet  1996  Kenneth Branagh  actor    Hamlet  5.0

### How many "Hamlet" roles have been listed in all film credits through history?

In [35]:
len(hamlet)

342

### How many people have played an "Ophelia"?

In [40]:
ophelia_actors = cast[cast["character"]=="Ophelia"]["name"]
len(ophelia_actors.unique())

115

### How many people have played a role called "The Dude"?

In [41]:
dude_actors = cast[cast["character"] == "The Dude"]["name"]
len(dude_actors.unique())

19

### How many people have played a role called "The Stranger"?

In [43]:
stranger_actors = cast[cast["character"] == "The Stranger"]["name"]
len(stranger_actors.unique())

202

### How many roles has Sidney Poitier played throughout his career?

In [44]:
sid = cast[cast.name == "Sidney Poitier"]["character"]
len(sid.unique())

41

### How many roles has Judi Dench played?

In [45]:
judi = cast[cast.name == "Judi Dench"]["character"]
len(judi.unique())

46

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [46]:
cary = cast[cast.name == "Cary Grant"]
cary_1940 = cary[cary["year"] == 1940]
cary_1940[cary_1940["n"] ==2]

                   title  year        name   type   character    n
871423  My Favorite Wife  1940  Cary Grant  actor  Nick Arden  2.0

In [47]:
# n==2 => Supporting Role

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [48]:
cary_1940[cary_1940["n"] ==1]

,title,year,name,type,character,n
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0

In [49]:
# n==1 => Leading Role

### How many roles were available for actors in the 1950s?

In [50]:
roles_1950 = cast[cast.year == 1950]
len(roles_1950[roles_1950.type == "actor"])

16760

### How many roles were available for actresses in the 1950s?

In [52]:
len(roles_1950[roles_1950.type == "actress"])

5637

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [53]:
roles_1980 = cast[cast.year <= 1980]
leadRoles_1980 = roles_1980[roles_1980.n ==1]

len(leadRoles_1980)

65139

### How many non-leading roles were available through from the beginning of film history through 1980?

In [54]:
NonLeadRoles_1980 = roles_1980[roles_1980.n !=1]

len(NonLeadRoles_1980)

1117660

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [55]:
roles_1980["n"].isna().sum()

448347